import React from 'react';
var slovarg={' ':' ','a':'𝖆','b':'𝖇','c':'𝖈','d':'𝖉','e':'𝖊','f':'𝖋','g':'𝖌','h':'𝖍','i':'𝖎','j':'𝖏','k':'ҝ','l':'𝖑','m':'𝖒',
    'n':'𝖓','o':'𝖔','p':'𝖕','q':'𝖖','r':'𝖗','s':'𝖘','t':'𝖙','u':'𝖚','v':'𝖛','w':'𝖜','x':'𝖝','y':'𝖞','z':'𝖟','1':'１','2':'２','3':'３',
    '4':'４','5':'５','6':'６','7':'７','8':'８','9':'９','0':'０','A':'𝕬','B':'𝕭','C':'𝕮','D':'𝕯','E':'𝕰','F':'𝕱','G':'𝕲','H':'𝕳','I':'𝕴',
    'J':'𝕵','K':'𝕶','L':'𝕷', 'M':'𝕸','N':'𝕹','O':'𝕺','P':'𝕻','Q':'𝕼','R':'𝕽','S':'𝕾','T':'𝕿','U':'𝖀','V':'𝖁','W':'𝖂','X':'𝖃','Y':'𝖄','Z':'𝖅'};

var slovaro={' ':' ','a':'𝕒','b':'𝕓','c':'𝕔','d':'𝕕','e':'𝕖','f':'𝕗','g':'𝕘','h':'𝕙','i':'𝕚','j':'𝕛','k':'𝕜','l':'𝕝','m':'𝕞',
    'n':'𝕟','o':'𝕠','p':'𝕡','q':'𝕢','r':'𝕣','s':'𝕤','t':'𝕥','u':'𝕦','v':'𝕧','w':'𝕨','x':'𝕩','y':'𝕪','z':'𝕫','1':'𝟙','2':'𝟚','3':'𝟛',
    '4':'𝟜','5':'𝟝','6':'𝟞','7':'𝟟','8':'𝟠','9':'𝟡','0':'𝟘','A':'𝔸','B':'𝔹','C':'ℂ','D':'𝔻','E':'𝔼','F':'𝔽','G':'𝔾','H':'ℍ','I':'𝕀',
    'J':'𝕁','K':'𝕂','L':'𝕃', 'M':'𝕄','N':'ℕ','O':'𝕆','P':'ℙ','Q':'ℚ','R':'ℝ','S':'𝕊','T':'𝕋','U':'𝕌','V':'𝕍','W':'𝕎','X':'𝕏','Y':'𝕐','Z':'ℤ'};

var slovarh={' ':' ','a':'𝓪','b':'𝓫','c':'𝓬','d':'𝓭','e':'𝓮','f':'𝓯','g':'𝓰','h':'𝓱','i':'𝓲','j':'𝓳','k':'𝓴','l':'𝓵','m':'𝓶',
    'n':'𝓷','o':'𝓸','p':'𝓹','q':'𝓺','r':'𝓻','s':'𝓼','t':'𝓽','u':'𝓾','v':'𝓿','w':'𝔀','x':'𝔁','y':'𝔂','z':'𝔃','A':'𝓐','B':'𝓑',
    'C':'𝓒','D':'𝓓','E':'𝓔','F':'𝓕','G':'𝓖','H':'𝓗','I':'𝓘',
    'J':'𝓙','K':'𝓚','L':'𝓛', 'M':'𝓜','N':'𝓝','O':'𝓞','P':'𝓟','Q':'𝓠','R':'𝓡','S':'𝓢','T':'𝓣','U':'𝓤','V':'𝓥','W':'𝓦','X':'𝓧','Y':'𝓨','Z':'𝓩'};


var sloc={' ':' ','a':'ⓐ','b':'ⓑ','c':'ⓒ','d':'ⓓ','e':'ⓔ','f':'ⓕ','g':'ⓖ','h':'ⓗ','i':'ⓘ','j':'ⓙ','k':'ⓚ','l':'ⓛ','m':'ⓜ',
    'n':'ⓝ','o':'ⓞ','p':'ⓟ','q':'ⓠ','r':'ⓡ','s':'ⓢ','t':'ⓣ','u':'ⓤ','v':'ⓥ','w':'ⓦ','x':'ⓧ','y':'ⓨ','z':'ⓩ','1':'①','2':'②','3':'③',
    '4':'④','5':'⑤','6':'⑥','7':'⑦','8':'⑧','9':'⑨','0':'⓪','A':'Ⓐ','B':'Ⓑ',
    'C':'Ⓒ','D':'Ⓓ','E':'Ⓔ','F':'Ⓕ','G':'Ⓖ','H':'Ⓗ','I':'Ⓘ',
    'J':'Ⓙ','K':'Ⓚ','L':'Ⓛ', 'M':'Ⓜ','N':'Ⓝ','O':'Ⓞ','P':'Ⓟ','Q':'Ⓠ','R':'Ⓡ','S':'Ⓢ','T':'Ⓣ','U':'Ⓤ','V':'Ⓥ','W':'Ⓦ','X':'Ⓧ','Y':'Ⓨ','Z':'Ⓩ'};

var slovargrece={' ':' ','a':'Λ','b':'β','c':'Ͼ','d':'Đ','e':'Σ','f':'Ḟ','g':'Ḡ','h':'Ḥ','i':'ḭ','j':'J','k':'Ḳ','l':'Ɫ','m':'Ṃ','n':'Ṇ','o':'Ṓ','p':'Ᵽ','q':'Q','r':'Ṝ','s':'Ṩ','t':'Ṫ','u':'Ṷ','v':'Ṿ','w':'Ẅ','x':'Ẍ','y':'Ῡ','z':'Ẓ','1':'1','2':'2','3':'3','4':'4','5':'5','6':'6','7':'7','8':'8','9':'9','0':'0','A':'Λ','B':'β','C':'Ͼ','D':'Đ','E':'Σ','F':'Ḟ','G':'Ḡ','H':'Ḥ','I':'ḭ','J':'J','K':'Ḳ','L':'Ɫ', 'M':'Ṃ','N':'Ṇ','O':'Ṓ','P':'Ᵽ','Q':'Q','R':'Ṝ','S':'Ṩ','T':'Ṫ','U':'Ṷ','V':'Ṿ','W':'Ẅ','X':'Ẍ','Y':'Ῡ','Z':'Ẓ'}


function Transpo(props) {
    const text=props.text;
    const mode=props.mode;
    const texta=text.split('');
    if(mode==='g') {
        for (let i = 0; i < texta.length; i++) {
            if (texta[i] in slovarg) {
                texta[i] = slovarg[texta[i]];
            }
        }
        return <h1>{texta.join('')}</h1>;
    }if(mode==='o') {
        for (let i = 0; i < texta.length; i++) {
            if (texta[i] in slovaro) {
                texta[i] = slovaro[texta[i]];
            }
        }
        return <h1>{texta.join('')}</h1>;
    }
    if(mode==='h') {
        for (let i = 0; i < texta.length; i++) {
            if (texta[i] in slovarh) {
                texta[i] = slovarh[texta[i]];
            }
        }
        return <h1>{texta.join('')}</h1>;
    }
    if(mode==='c') {
        for (let i = 0; i < texta.length; i++) {
            if (texta[i] in sloc) {
                texta[i] = sloc[texta[i]];
            }
        }
        return <h1>{texta.join('')}</h1>;
    }
    else{
        return <h1>{texta.join('')}</h1>;
    }
}
export default Transpo;
